using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class NewBehaviourScript : MonoBehaviour
{
    //定义视标位置数组
    float[,] sightingPostLocation =new float[72,2]{
        { -4,4},{ -3,4},{-2,4 },{-1,4 },{0,4 },{1,4 },{2,4 },{3,4 },{4,4 },
        { -4,3},{ -3,3},{-2,3 },{-1,3 },{0,3 },{1,3 },{2,3 },{3,3 },{4,3 },
        { -4,2},{ -3,2},{-2,2 },{-1,2 },{0,2 },{1,2 },{2,2 },{3,2 },{4,2 },
        { -4,1},{ -3,1},{-2,1 },{-1,1 },{0,1 },{1,1 },{2,1 },{3,1 },{4,1 },
        { -4,-1},{ -3,-1},{-2,-1 },{-1,-1 },{0,-1 },{1,-1 },{2,-1 },{3,-1 },{4,-1 },
        { -4,-2},{ -3,-2},{-2,-2 },{-1,-2 },{0,-2 },{1,-2 },{2,-2 },{3,-2 },{4,-2 },
        { -4,-3},{ -3,-3},{-2,-3 },{-1,-3 },{0,-3 },{1,-3 },{2,-3 },{3,-3 },{4,-3 },
        { -4,-4},{ -3,-4},{-2,-4 },{-1,-4 },{0,-4 },{1,-4 },{2,-4 },{3,-4 },{4,-4 }
    };
    // Start is called before the first frame update
    void Start()
    {
        
    }

    // Update is called once per frame
    void Update()
    {
        
    }
}
